<script setup lang="ts">
const faqData = [
  {
    heading: 'Что такое RuCode.Премия?',
    content:
      'RuCode.Премия – ежегодная премия, присуждаемая людям за достижения в сфере искусственного интеллекта, отмечающая людей, проекты и организации, которые вносят значимый вклад в развитие, внедрение и популяризацию технологий искусственного интеллекта.',
  },
  {
    heading: 'Кто может принять участие?',
    content:
      'Категории: «Персоны» — физические лица; «Проекты» — команды, сообщества, лаборатории и инициативы без юридического лица; «Организации» — юридические лица.',
  },
  {
    heading: 'Как принять участие?',
    content:
      '<a class="not-hover:underline" href="https://edu.mipt.ru/member/meroprijatija/rucode-premiya-2026/" target="_blank">Зарегистрируйтесь на сайте</a>, заполните регистрационные данные, выберите категорию и номинацию, заполните заявку и прикрепите материалы.',
  },
  {
    heading: 'Можно ли подать заявки в несколько номинаций?',
    content:
      'Да. Один участник, проект или организация могут подать заявки в несколько номинаций при соответствии требованиям. При этом в финал может выйти только одна заявка от одного участника, проекта или организации — та, которая получила наиболее высокую экспертную оценку и в наибольшей степени соответствует критериям номинации.',
  },
  {
    heading: 'Можно ли изменить заявку после отправки?',
    content: 'Да, до окончания приема заявок, обратившись в организационный комитет.',
  },
  {
    heading: 'Какие материалы необходимо приложить?',
    content:
      'Перечень материалов зависит от выбранной номинации и указан на странице подачи заявки.',
  },
  {
    heading: 'Как проходит отбор победителей?',
    content:
      'На первом этапе проводится техническая проверка всех заявок. Допущенные на следующий этап заявки проходят экспертную оценку. Для заявок на номинацию «Генерация будущего» также проводится народное голосование. По итогам формируется шорт-лист финалистов, вышедших в финал. Среди финалистов определяются лауреаты и номинанты премии.',
  },
  {
    heading: 'Что такое шорт-лист?',
    content:
      'Список финалистов, чьи заявки получили наиболее высокие оценки экспертного жюри и вышли в финал.',
  },
  {
    heading: 'По каким критериям оцениваются заявки?',
    content: 'Критерии индивидуальны для каждой номинации.',
  },
  {
    heading: 'Во всех ли номинациях проводится народное голосование?',
    content: 'Нет. Только в номинации "Генерация будущего".',
  },
  {
    heading: 'Могут ли лауреаты RuCode.Премии прошлых лет принять участие в Премии?',
    content:
      'Нет. Лауреаты RuCode.Премии прошлых лет не могут принимать участие в последующих конкурсных отборах. Это правило направлено на поддержку новых участников и развитие новых проектов, инициатив и организаций в сфере искусственного интеллекта.',
  },
  {
    heading: 'Когда будут объявлены результаты?',
    content:
      'После завершения всех этапов оценки. Информация публикуется на официальном сайте RuCode.Премии.',
  },
  {
    heading: 'Что делать при технических проблемах?',
    content: 'Свяжитесь с организационным комитетом по контактам, указанным на сайте.',
  },
]
</script>

<template>
  <section class="space-y-6 lg:space-y-10">
    <UiHeading class="text-purple-primary text-left lg:text-center" tag="h2"
      >Вы спрашиваете, мы отвечаем</UiHeading
    >
    <div class="space-y-5">
      <UiAccordion v-for="item in faqData" :key="item.heading" :title="item.heading">
        <p class="text-[16px] tracking-[0.8px] lg:text-[18px]" v-html="item.content" />
      </UiAccordion>
    </div>
  </section>
</template>

<style scoped></style>
